[
    {
        "id": 1,
        "name": "Peyton",
        "description": "8008135 guy.",
        "scene_file": "characters/peyton.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        },
        "portrait": "characters/peyton.png"
    },
    {
        "id": 2,
        "name": "Crying Ball Man",
        "description": "",
        "scene_file": "characters/cryingball.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        },
        "portrait": "characters/cryingball.png"
    },
    {
        "id": 3,
        "name": "Steven",
        "description": "",
        "scene_file": "characters/steven.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        },
        "portrait": "characters/steven.png"
    },
    {
        "id": 4,
        "name": "Blockhead",
        "description": "Generally nervous, been through a lot, but willing to help. Be good to him, and he’ll have your back. Could he be a bit of the everyman archetype? Usually extremely fucking high out of his mind. ",
        "scene_file": "characters/blockhead.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "village",
            "position": [1,-5]
        },
        "portrait": "characters/blockhead.png"
    },
    {
        "id": 5,
        "name": "Farmer Sack Man",
        "description": "Was a farmer, doubled as a scarecrow. He’s not sure how to pass his wisdom onto the younger folks. Can wisdom be given? Or must lessons be learned on one’s own before they can truly understand? Type of guy to sneak a flask of whisky into his coffee and wink at you cheerfully if you catch him.",
        "scene_file": "characters/farmersack.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "village",
            "position": [1,-5]
        },
        "portrait": "characters/farmersack.png"
    },
    {
        "id": 6,
        "name": "Chrome Knight",
        "description": "Mr cool guy here crosses his arm at you. He won’t join your village unless you’ve earned the right for him to join you, by his own standards. He is still respectful, but with a condescending nature. He’s been around and seen a lot more than you, or so he believes. Perhaps he’ll even let you take up that massive old sword on his back?...if you can beat him in 1on1 combat",
        "scene_file": "characters/chromeknight.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        },
        "portrait": "characters/chromeknight.png"
    },
    {
        "id": 7,
        "name": "Dirty ol' Bot",
        "description": "Was programmed without an ego. What are the benefits? What are the downfalls? Generally pleasant and chill to be around. Mayhaps he believes himself to be a trash salesman, somebody who really understands that one mans trash, is another mans treasure. ",
        "scene_file": "characters/dirtybot.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "village",
            "position": [1,-5]
        },
        "portrait": "characters/dirtybot.png"
    },
    {
        "id": 8,
        "name": "Dead Bread",
        "description": "Bio: (Some things are just better left un-explained - unknown race/origin) Is dead. He can join your village, but he’s dead. That’s it.",
        "scene_file": "characters/deadbread.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "village",
            "position": [1,-5]
        },
        "portrait": "characters/deadbread.png"
    },
    {
        "id": 9,
        "name": "The Cool Guy",
        "description": "",
        "scene_file": "characters/coolguy.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "village",
            "position": [1,-5]
        }
    },
    {
        "id": 10,
        "name": "Snot Nosed Brat",
        "description": "Snot Nosed Brat: For some reason this kid doesn’t think sonic is cool at all. He saw the blue guy do something embarrassing, or maybe he",
        "scene_file": "characters/brat.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 11,
        "name": "Bird Guy",
        "description": "You hear a strange strange bird sound, it’s odd and it never sounds quite right. Eventually you happen to stumble upon a pigeon box / bird cage, you realize there is a strange man inside, everyone says I sound like a pigeon…. He gives you a tape and it sounds like birds singing. LATER: There’s a peaceful bird later out in the wild, a truly beautiful bird sound, you find him and he’s truly perfected the art. ",
        "scene_file": "characters/birdguy.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 12,
        "name": "Bird Hunter",
        "description": "You hear a gunshot, you find the bird man dead, over his body a hunter, a proud hunter at that, shot himself a smidgeon, the body don’t look quite right but the sound was spot on.. Maybe it’s actually fake though? Maybe this bird man is smarter than he seems. Could he have perfected the smidgeons natural defense mechanism of playing dead? ",
        "scene_file": "characters/birdhunter.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 13,
        "name": "Thespians",
        "description": "You encounter a stage at a carnival where there’s photogrammetry heads on top of our bodies, and they’re arguing about game design & art design choices. ",
        "scene_file": "characters/thespians.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 14,
        "name": "Biggie",
        "description": "Catfish merchant, dude lives in a swamp biome on the island or out in the dungeons under a big ole log. Maybe you have to have a snorkel to go down and see him. He sells scrap treasures which can be polished and turned into a random weapon or item reward.",
        "scene_file": "characters/biggie.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 15,
        "name": "Tree Trimmer",
        "description": "People grooming hedge/ boutique tree area which blocks off your route. Upon examination, they mention to you that this is serious work and moving a hedge is not a simple task. It's literally a life or death arrangement. You can argue that this surely couldn't be the case, such a hedge is just a mere plant. The only way to get them to move is to distract them with another emergency hedge that needs trimming. After they leave you can pass through this area, but as you pass through the hedge grabs onto you, and you are sucked into it. It opens up into a small hedge area where the very roots of this hedge are sapping the life from trapped creatures to enact their plans of taking over the local ecology.",
        "scene_file": "characters/treetrimmer.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 16,
        "name": "Steam King",
        "description": "Man who redirects all the town steam for his underground steam basket, if he steams long enough he turns into a steamed lobster, the local people are wondering why their utility bills are high",
        "scene_file": "characters/steamking.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 17,
        "name": "Mitch Type Beat",
        "description": "Whoah that's bleak... the bottom of this banana turns toxic... wait that's a spoiler for the end of my banana",
        "scene_file": "characters/mitchbeat.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 18,
        "name": "The Pilgrim",
        "description": "A man you encounter at various points during your journey. Each time you encounter him, it is during a pivotal point of your sky country experience. He often comes and regales your party with tales of his adventures, and invites you to come along on some. As Sky Country grows and matures, so does he. Some say that he is a brother, a friend, an adventurer, others say he's simply an idea. ",
        "scene_file": "characters/pilgrim.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 19,
        "name": "Jersey Devil",
        "description": "Pine Barrens, jersey devil lives in the woods, actually a really nice guy, misunderstood, does eat villagers sheep, confused with TIM, who is ",
        "scene_file": "characters/jerseydevil.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 20,
        "name": "Tree Monger",
        "description": "If you hit the trees with non-harvesting tools, eventually a beast will come out and reprimand you for hitting the trees. Eventually you can find his cabin, he’s married to a tree and gives you the wisdom of the trees. ",
        "scene_file": "characters/treemonger.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 21,
        "name": "Neon Goblin",
        "description": "The goblin that comes out at noon and slaps the shit out of any trespassers and, begins to tell you mundane information, becomes stealth escape op.",
        "scene_file": "characters/neongoblin.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 22,
        "name": "Paul (The Duke of Corn)",
        "description": "Has been stockpiling corn and stealing it from the market every night at 3:33am All corn in his house are physics objects, he has many kernels who worship he. His kernels believe he is the true ruler and organize around him like ants or bees. He aims to make the best creamed corn chowder. There is however the false prophet, Jessamine, the cobbed corn Messiah. She believes that corn should be not measured and counted by its kernel, but rather revered as a collective, a cob intact. She is a militant adversary and is ultimately looking to bring about the dawn of the cornucopia, an age in which the cob stands upright instead of separating itself kernel by kernel, or even more disgustingly, as a mash. ",
        "scene_file": "characters/paul.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 23,
        "name": "Sgt. Scrap",
        "description": "Trashman, literally drives a tank over your trash compacts it flat, then his subordinate Skeeter has to spatula the trash patty onto a grill on the back of the tank. He then serves up the grilled trash to bots at Sergeant Burger in scrap country ",
        "scene_file": "characters/scrap.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    },
    {
        "id": 24,
        "name": "Larry the Louse",
        "description": "While in the forest, you can encounter the enemy known as a “Forest Louse” (detailed in enemy/monster's document). As long as the louse you encounter is not accompanied by a pack of lice, you can follow the louse back to its colony to contend for its hoard. If you manage to wipe out the colony you force the horde of lice to move elsewhere. After clearing the colony you encounter a special louse. Larry the louse, is a very particularly sentient louse, he says all the lice are sentient truthfully, but they don’t want to waste their time on haggling, or speaking to those who simply can’t understand. He does hold it against you a wee bit for wiping out his kin, but also, he is self-admittedly a bit of a war profiteer, 189th of his bloodline as a matter of fact. Lice always finds a new scalp to stain, but his goals are to build a colony of his own. Here you can buy back lost items, OR, (if the first is too mechanically OP), you can buy unique and coveted items. Understandably, he can’t stick around for long, as he’s gotta keep up with the horde so after you buy from him, he’s gone in the blink of an eye. ",
        "scene_file": "characters/larry.tscn",
        "disposition": 0,
        "relations": [],
        "dialogues": [],
        "location": {
            "level": "",
            "position": [1,-5]
        }
    }
]